auth.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Модуль сущностей, автоматов и их тесты</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Модуль сущностей, автоматов и их тесты"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-10-13T17:03+0400"/>
<meta name="author" content="rigidus"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Модуль сущностей, автоматов и их тесты</h1>




<link rel="stylesheet" type="text/css" href="css/css.css" />


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Введение</a></li>
<li><a href="#sec-2">2 Шаблоны</a></li>
<li><a href="#sec-3">3 Функционал</a>
<ul>
<li><a href="#sec-3-1">3.1 Шаблон логина</a></li>
<li><a href="#sec-3-2">3.2 Шаблон логаута</a></li>
<li><a href="#sec-3-3">3.3 Страница регистрации и ее контроллер</a></li>
<li><a href="#sec-3-4">3.4 Событие создания пользователя</a></li>
<li><a href="#sec-3-5">3.5 Страница выхода из системы и ее контроллер</a></li>
<li><a href="#sec-3-6">3.6 Событие выхода пользователя из системы</a></li>
<li><a href="#sec-3-7">3.7 Страница логина и ее контроллер</a></li>
<li><a href="#sec-3-8">3.8 Обобщенный метод извлечения авторизационных данных</a></li>
<li><a href="#sec-3-9">3.9 Функция проверки авторизационных данных - в простейшем случае логина и пароля</a></li>
<li><a href="#sec-3-10">3.10 Событие успешного входа пользователя в систему</a></li>
<li><a href="#sec-3-11">3.11 Событие неуспешного входа пользователя в систему</a></li>
<li><a href="#sec-3-12">3.12 Забыл пароль</a></li>
<li><a href="#sec-3-13">3.13 Javascript для форм, необязательно</a></li>
<li><a href="#sec-3-14">3.14 Функцию проверки залогинен ли пользователь</a></li>
<li><a href="#sec-3-15">3.15 Функцию проверки прав пользователя на доступ к какому-то объекту</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Тесты</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Введение</h2>
<div class="outline-text-2" id="text-1">


<p>
  Как пользователь я хочу иметь возможность зарегистрироваться на сайте. Сразу после
  регистрации я хочу быть залогиненным в авторизованную сессию.
</p>
<p>
  Как пользователь, я хочу иметь возможность выйти из авторизованной сессии после окончания
  работы.
</p>
<p>
  Как пользователь, я хочу войти в авторизованную сессию по своему емейлу и паролю.
</p>
<p>
  Как разработчик, я хочу конфигурировать url-ы, на которые попадает пользователь при
  выполнении этого сценария и навешивать свои обработчики на события:
</p><ul>
<li>регистрация пользователя
</li>
<li>успешный вход пользователя
</li>
<li>неуспешный вход пользователя
</li>
<li>выход пользователя
</li>
</ul>


<p>
  Что нам для этого нужно?
</p><ul>
<li>Сущность <code>User</code>, имеющая поля <code>email</code> и <code>password</code>
</li>
<li>Движок создания форм, функции которого определены не здесь
</li>
</ul>


<p>
  Как это работает?
</p>
<p>
  <code>При регистрации</code> пользователь заполняет форму с именем, емейлом и паролем на странице
  регистрации. Страница регистрации доступна только есои пользователь в данный момент не
  залогинен. Контроллер регистрации получает данные формы и вызывает событие создания
  пользователя (<code>create-user</code>).
</p>
<p>
  <code>При логине</code> пользователь вводит email и пароль, который передается контроллеру
  логина. Контроллер логина извлекает (<code>get-auth-data</code>) email и пароль, проверяет их
  (<code>check-auth-data</code>) и в случае успеха устанавливает переменную сессии <code>current-user</code> и
  вызывает <code>auth-success</code>. В случае неудачи вызывает <code>auth-fail</code>.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Шаблоны</h2>
<div class="outline-text-2" id="text-2">

<p>  Соберем шаблоны логина и логаута
</p>



<pre class="src src-closure-template-html"><span style="color: #cd0000;">// -*- mode: closure-template-html; fill-column: 140 -*-</span>
{<span style="color: #00cd00; font-weight: bold;">namespace</span> <span style="color: #0000ee; font-weight: bold;">authtpl</span>}

{<span style="color: #00cd00; font-weight: bold;">template</span> <span style="color: #0000ee; font-weight: bold;">logintpl}</span>
  &lt;&lt;<span style="color: #0000ee; font-weight: bold;">loginform_tpl</span>&gt;&gt;
{<span style="color: #00cd00; font-weight: bold;">/template</span>}

{<span style="color: #00cd00; font-weight: bold;">template</span> <span style="color: #0000ee; font-weight: bold;">logouttpl}</span>
  &lt;&lt;<span style="color: #0000ee; font-weight: bold;">logoutform_tpl</span>&gt;&gt;
{<span style="color: #00cd00; font-weight: bold;">/template</span>}
</pre>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Функционал</h2>
<div class="outline-text-2" id="text-3">


<p>
  Соберем контроллеры и все функции, которые контроллеры вызывают
</p>



<pre class="src src-lisp">(<span style="color: #00cdcd; font-weight: bold;">in-package</span> #<span style="color: #0000ee; font-weight: bold;">:moto</span>)

<span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1057;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1091;&#1077;&#1084; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;</span>
(closure-template:compile-template
 <span style="color: #0000ee; font-weight: bold;">:common-lisp-backend</span>
 (pathname
  (concatenate 'string *base-path* <span style="color: #00cd00;">"mod/auth/auth-tpl.htm"</span>)))

&lt;&lt;auth_fn_contents&gt;&gt;

&lt;&lt;auth_test&gt;&gt;
</pre>


<p>
  Мы вводим:
</p>

</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Шаблон логина</h3>
<div class="outline-text-3" id="text-3-1">





<pre class="src src-html">&lt;<span style="color: #0000ee; font-weight: bold;">form</span> <span style="color: #cdcd00;">method</span>=<span style="color: #00cd00;">"POST"</span> <span style="color: #cdcd00;">name</span>=<span style="color: #00cd00;">"loginform"</span>&gt;
    &lt;<span style="color: #0000ee; font-weight: bold;">input</span> <span style="color: #cdcd00;">type</span>=<span style="color: #00cd00;">"text"</span> <span style="color: #cdcd00;">id</span>=<span style="color: #00cd00;">"login"</span> <span style="color: #cdcd00;">name</span>=<span style="color: #00cd00;">"login"</span> /&gt;
    &lt;<span style="color: #0000ee; font-weight: bold;">input</span> <span style="color: #cdcd00;">type</span>=<span style="color: #00cd00;">"password"</span> <span style="color: #cdcd00;">id</span>=<span style="color: #00cd00;">"password"</span> <span style="color: #cdcd00;">name</span>=<span style="color: #00cd00;">"password"</span> /&gt;
    &lt;<span style="color: #0000ee; font-weight: bold;">input</span> <span style="color: #cdcd00;">type</span>=<span style="color: #00cd00;">"submit"</span> /&gt;
&lt;/<span style="color: #0000ee; font-weight: bold;">form</span>&gt;
</pre>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Шаблон логаута</h3>
<div class="outline-text-3" id="text-3-2">





<pre class="src src-html">&lt;<span style="color: #0000ee; font-weight: bold;">form</span> <span style="color: #cdcd00;">method</span>=<span style="color: #00cd00;">"POST"</span> <span style="color: #cdcd00;">name</span>=<span style="color: #00cd00;">"logoutform"</span>&gt;
    &lt;<span style="color: #0000ee; font-weight: bold;">input</span> <span style="color: #cdcd00;">type</span>=<span style="color: #00cd00;">"hidden"</span> <span style="color: #cdcd00;">name</span>=<span style="color: #00cd00;">"logout"</span> <span style="color: #cdcd00;">value</span>=<span style="color: #00cd00;">"logout"</span> /&gt;
    &lt;<span style="color: #0000ee; font-weight: bold;">input</span> <span style="color: #cdcd00;">type</span>=<span style="color: #00cd00;">"submit"</span> <span style="color: #cdcd00;">value</span>=<span style="color: #00cd00;">"logout"</span> /&gt;
&lt;/<span style="color: #0000ee; font-weight: bold;">form</span>&gt;
</pre>


</div>

</div>
