auth.org
** Страница регистрации и ее контроллер

   Страница регистрации использует движок форм для показа формы пользователю и при
   выполнении регистрации вызывает событие =create-user=.

   #+NAME: auth_fn_contents
   #+BEGIN_SRC lisp

     ;; Страница регистрации
     (restas:define-route reg ("/reg")
       (with-wrapper
         (concatenate
          'string
          "<h1>Страница регистрации</h1>"
          (if *current-user*
              "Регистрация невозможна - пользователь залогинен. <a href=\"/logout\">Logout</a>"
              (frm (tbl
                    (list
                     (row "Имя пользователя" (fld "name"))
                     (row "Пароль" (fld "password"))
                     (row "Email" (fld "email"))
                     (row "" (submit "Зарегистрироваться")))))))))

     ;; Контроллер страницы регистрации
     (restas:define-route reg-ctrl ("/reg" :method :post)
       (with-wrapper
         (let* ((p (alist-to-plist (hunchentoot:post-parameters*))))
           (setf (hunchentoot:session-value 'current-user)
                 (create-user (getf p :name)
                              (getf p :password)
                              (getf p :email))))))
   #+END_SRC

** Событие создания пользователя

   #+NAME: auth_fn_contents
   #+BEGIN_SRC lisp

     ;; Событие создания пользователя
     (defun create-user (name password email)
       "Создание пользователя. Возвращает id пользователя"
       (let ((user-id (id (make-user :name name :password password :email email :ts-create (get-universal-time)))))
         (dbg "Создан пользователь: ~A" user-id)
         ;; Делаем его залогиненным
         (upd-user (get-user user-id) (list :state ":LOGGED"))
         ;; Возвращаем user-id
         user-id))
   #+END_SRC

** Страница выхода из системы и ее контроллер

   #+NAME: auth_fn_contents
   #+BEGIN_SRC lisp

     ;; Страница выхода из системы
     (restas:define-route logout ("/logout")
       (with-wrapper
         (concatenate
          'string
          "<h1>Страница выхода из системы</h1>"
          (if *current-user*
              (frm (tbl
                    (list
                     (row "" (submit "Выйти")))))
              "Выход невозможен - никто не залогинен"
              ))))

     ;; Контроллер страницы выхода из системы
     (restas:define-route logout-ctrl ("/logout" :method :post)
       (with-wrapper
         (prog1
             (format nil "~A" (logout-user *current-user*))
           (setf (hunchentoot:session-value 'current-user) nil))))
   #+END_SRC

** Событие выхода пользователя из системы

   #+NAME: auth_fn_contents
   #+BEGIN_SRC lisp

     ;; Событие выхода
     (defun logout-user (current-user)
       (takt (get-user current-user) :unlogged))
   #+END_SRC

** Страница логина и ее контроллер

   Контроллер логина использует обобщенный метод =get-auth-data= для извлечения данных
   авторизации и функцию их проверки =check-auth-data=.

   При успешной проверке устанавливает переменную сессии =current-user= с помощью функции
   =set-session= и выполняет =login-user-success=.

   При неуcпехе выполняет =login-user-fail=.

   #+NAME: auth_fn_contents
   #+BEGIN_SRC lisp

     ;; Страница логина
     (restas:define-route login ("/login")
       (with-wrapper
         (concatenate
          'string
          "<h1>Страница авторизации</h1>"
          (if *current-user*
              "Авторизация невозможна - пользователь залогинен. <a href=\"/logout\">Logout</a>"
              (frm (tbl
                    (list
                     (row "Email" (fld "email"))
                     (row "Пароль" (fld "password"))
                     (row "" (submit "Войти")))))))))

     ;; Контроллер страницы логина
     (restas:define-route login-ctrl ("/login" :method :post)
       (with-wrapper
         (aif (check-auth-data (get-auth-data (hunchentoot:post-parameters*)))
              (progn
                (setf (hunchentoot:session-value 'current-user) it)
                (login-user-success it))
              (login-user-fail))))
   #+END_SRC

