auth.html

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Страница регистрации и ее контроллер</h3>
<div class="outline-text-3" id="text-3-3">


<p>
   Страница регистрации использует движок форм для показа формы пользователю и при
   выполнении регистрации вызывает событие <code>create-user</code>.
</p>



<pre class="src src-lisp"><span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080;</span>
(restas:define-route reg (<span style="color: #00cd00;">"/reg"</span>)
  (<span style="color: #00cdcd; font-weight: bold;">with-wrapper</span>
    (concatenate
     'string
     <span style="color: #00cd00;">"&lt;h1&gt;&#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080;&lt;/h1&gt;"</span>
     (<span style="color: #00cdcd; font-weight: bold;">if</span> *current-user*
         <span style="color: #00cd00;">"&#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1103; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1072; - &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1079;&#1072;&#1083;&#1086;&#1075;&#1080;&#1085;&#1077;&#1085;. &lt;a href=\"/logout\"&gt;Logout&lt;/a&gt;"</span>
         (frm (tbl
               (list
                (row <span style="color: #00cd00;">"&#1048;&#1084;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;"</span> (fld <span style="color: #00cd00;">"name"</span>))
                (row <span style="color: #00cd00;">"&#1055;&#1072;&#1088;&#1086;&#1083;&#1100;"</span> (fld <span style="color: #00cd00;">"password"</span>))
                (row <span style="color: #00cd00;">"Email"</span> (fld <span style="color: #00cd00;">"email"</span>))
                (row <span style="color: #00cd00;">""</span> (submit <span style="color: #00cd00;">"&#1047;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;"</span>)))))))))

<span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1050;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1083;&#1077;&#1088; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080;</span>
(restas:define-route reg-ctrl (<span style="color: #00cd00;">"/reg"</span> <span style="color: #0000ee; font-weight: bold;">:method</span> <span style="color: #0000ee; font-weight: bold;">:post</span>)
  (<span style="color: #00cdcd; font-weight: bold;">with-wrapper</span>
    (<span style="color: #00cdcd; font-weight: bold;">let*</span> ((p (alist-to-plist (hunchentoot:post-parameters*))))
      (setf (hunchentoot:session-value 'current-user)
            (create-user (getf p <span style="color: #0000ee; font-weight: bold;">:name</span>)
                         (getf p <span style="color: #0000ee; font-weight: bold;">:password</span>)
                         (getf p <span style="color: #0000ee; font-weight: bold;">:email</span>))))))
</pre>


</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Событие создания пользователя</h3>
<div class="outline-text-3" id="text-3-4">





<pre class="src src-lisp"><span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1057;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</span>
(<span style="color: #00cdcd; font-weight: bold;">defun</span> <span style="color: #0000ee; font-weight: bold;">create-user</span> (name password email)
  <span style="color: #00cd00;">"&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;. &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; id &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;"</span>
  (<span style="color: #00cdcd; font-weight: bold;">let</span> ((user-id (id (make-user <span style="color: #0000ee; font-weight: bold;">:name</span> name <span style="color: #0000ee; font-weight: bold;">:password</span> password <span style="color: #0000ee; font-weight: bold;">:email</span> email))))
    (dbg <span style="color: #00cd00;">"&#1057;&#1086;&#1079;&#1076;&#1072;&#1085; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;: ~A"</span> user-id)
    <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1044;&#1077;&#1083;&#1072;&#1077;&#1084; &#1077;&#1075;&#1086; &#1079;&#1072;&#1083;&#1086;&#1075;&#1080;&#1085;&#1077;&#1085;&#1085;&#1099;&#1084;</span>
    (upd-user (get-user user-id) (list <span style="color: #0000ee; font-weight: bold;">:state</span> <span style="color: #00cd00;">":LOGGED"</span>))
    <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084; user-id</span>
    user-id))
</pre>


</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Страница выхода из системы и ее контроллер</h3>
<div class="outline-text-3" id="text-3-5">





<pre class="src src-lisp"><span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1074;&#1099;&#1093;&#1086;&#1076;&#1072; &#1080;&#1079; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;</span>
(restas:define-route logout (<span style="color: #00cd00;">"/logout"</span>)
  (<span style="color: #00cdcd; font-weight: bold;">with-wrapper</span>
    (concatenate
     'string
     <span style="color: #00cd00;">"&lt;h1&gt;&#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1074;&#1099;&#1093;&#1086;&#1076;&#1072; &#1080;&#1079; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;&lt;/h1&gt;"</span>
     (<span style="color: #00cdcd; font-weight: bold;">if</span> *current-user*
         (frm (tbl
               (list
                (row <span style="color: #00cd00;">""</span> (submit <span style="color: #00cd00;">"&#1042;&#1099;&#1081;&#1090;&#1080;"</span>)))))
         <span style="color: #00cd00;">"&#1042;&#1099;&#1093;&#1086;&#1076; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1077;&#1085; - &#1085;&#1080;&#1082;&#1090;&#1086; &#1085;&#1077; &#1079;&#1072;&#1083;&#1086;&#1075;&#1080;&#1085;&#1077;&#1085;"</span>
         ))))

<span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1050;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1083;&#1077;&#1088; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1074;&#1099;&#1093;&#1086;&#1076;&#1072; &#1080;&#1079; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;</span>
(restas:define-route logout-ctrl (<span style="color: #00cd00;">"/logout"</span> <span style="color: #0000ee; font-weight: bold;">:method</span> <span style="color: #0000ee; font-weight: bold;">:post</span>)
  (<span style="color: #00cdcd; font-weight: bold;">with-wrapper</span>
    (<span style="color: #00cdcd; font-weight: bold;">prog1</span>
        (format nil <span style="color: #00cd00;">"~A"</span> (logout-user *current-user*))
      (setf (hunchentoot:session-value 'current-user) nil))))
</pre>


</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Событие выхода пользователя из системы</h3>
<div class="outline-text-3" id="text-3-6">





<pre class="src src-lisp"><span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1057;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077; &#1074;&#1099;&#1093;&#1086;&#1076;&#1072;</span>
(<span style="color: #00cdcd; font-weight: bold;">defun</span> <span style="color: #0000ee; font-weight: bold;">logout-user</span> (current-user)
  (takt (get-user current-user) <span style="color: #0000ee; font-weight: bold;">:unlogged</span>))
</pre>


</div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> Страница логина и ее контроллер</h3>
<div class="outline-text-3" id="text-3-7">


<p>
   Контроллер логина использует обобщенный метод <code>get-auth-data</code> для извлечения данных
   авторизации и функцию их проверки <code>check-auth-data</code>.
</p>
<p>
   При успешной проверке устанавливает переменную сессии <code>current-user</code> с помощью функции
   <code>set-session</code> и выполняет <code>login-user-success</code>.
</p>
<p>
   При неуcпехе выполняет <code>login-user-fail</code>.
</p>



<pre class="src src-lisp"><span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1083;&#1086;&#1075;&#1080;&#1085;&#1072;</span>
(restas:define-route login (<span style="color: #00cd00;">"/login"</span>)
  (<span style="color: #00cdcd; font-weight: bold;">with-wrapper</span>
    (concatenate
     'string
     <span style="color: #00cd00;">"&lt;h1&gt;&#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1072;&#1074;&#1090;&#1086;&#1088;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;&lt;/h1&gt;"</span>
     (<span style="color: #00cdcd; font-weight: bold;">if</span> *current-user*
         <span style="color: #00cd00;">"&#1040;&#1074;&#1090;&#1086;&#1088;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1072; - &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1079;&#1072;&#1083;&#1086;&#1075;&#1080;&#1085;&#1077;&#1085;. &lt;a href=\"/logout\"&gt;Logout&lt;/a&gt;"</span>
         (frm (tbl
               (list
                (row <span style="color: #00cd00;">"Email"</span> (fld <span style="color: #00cd00;">"email"</span>))
                (row <span style="color: #00cd00;">"&#1055;&#1072;&#1088;&#1086;&#1083;&#1100;"</span> (fld <span style="color: #00cd00;">"password"</span>))
                (row <span style="color: #00cd00;">""</span> (submit <span style="color: #00cd00;">"&#1042;&#1086;&#1081;&#1090;&#1080;"</span>)))))))))

<span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1050;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1083;&#1077;&#1088; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1083;&#1086;&#1075;&#1080;&#1085;&#1072;</span>
(restas:define-route login-ctrl (<span style="color: #00cd00;">"/login"</span> <span style="color: #0000ee; font-weight: bold;">:method</span> <span style="color: #0000ee; font-weight: bold;">:post</span>)
  (<span style="color: #00cdcd; font-weight: bold;">with-wrapper</span>
    (aif (check-auth-data (get-auth-data (hunchentoot:post-parameters*)))
         (<span style="color: #00cdcd; font-weight: bold;">progn</span>
           (setf (hunchentoot:session-value 'current-user) it)
           (login-user-success it))
         (login-user-fail))))
</pre>


</div>

</div>
