auth.org
** Обобщенный метод извлечения авторизационных данных

   В простейшем случае данные из объекта =request=, но возможны и другие варианты,
   поэтому этот обобщенный метод специфицируется объектом, из которого извлекаются данные.

   #+NAME: auth_fn_contents
   #+BEGIN_SRC lisp

     ;; Извлечение авторизационных данных
     (defmethod get-auth-data ((request list))
       (alist-to-plist request))
   #+END_SRC

** Функция проверки авторизационных данных - в простейшем случае логина и пароля

   Функция принимает в качестве параметра plist, который должен содержать =email= и
   =password= введенный пользователем.

   Функция проверяет, есть ли пользователь с этим email-ом и паролем и если есть -
   возвращает его id. Если нет - возвращает nil.

   #+NAME: auth_fn_contents
   #+BEGIN_SRC lisp

     ;; Проверка авторизационных данных
     (defun check-auth-data (auth-data)
       (let ((result (find-user :email (getf auth-data :email) :password (getf auth-data :password))))
         (if (null result)
             nil
             (id (car result)))))
   #+END_SRC

** Событие успешного входа пользователя в систему

   #+NAME: auth_fn_contents
   #+BEGIN_SRC lisp

     ;; Событие успешного входа
     (defun login-user-success (id)
       (takt (get-user id) :logged))
   #+END_SRC

** Событие неуспешного входа пользователя в систему

   #+NAME: auth_fn_contents
   #+BEGIN_SRC lisp

     ;; Событие неуспешного входа
     (defun login-user-fail ()
       "Wrong auth"
       )
   #+END_SRC

** TODO Забыл пароль
** TODO Javascript для форм, необязательно
** TODO Функцию проверки залогинен ли пользователь

   Создадим функцию, которая проверяет залогинен ли пользователь

   #+NAME: is-logged
   #+BEGIN_SRC lisp :exports code
     ;; (defun is-logged (request)
     ;;   ( (session-value current-user
   #+END_SRC

** TODO Функцию проверки прав пользователя на доступ к какому-то объекту
* Тесты

  Теперь у нас есть весь необходимый функционал, для работы авторизации. Мы можем его
  протестировать, для этого сформируем тест:

  #+NAME: auth_test
  #+BEGIN_SRC lisp

    ;; Тестируем авторизацию
    (defun auth-test ()
      <<auth_test_contents>>
      (dbg "passed: auth-test~%"))
    (auth-test)
  #+END_SRC

  #+NAME: auth_test_contents
  #+BEGIN_SRC lisp
    ;; Зарегистрируем пользователя
    (let* ((name "test-name")
           (password "test-password")
           (email "test-email")
           (new-user-id (create-user name password email)))
      ;; Проверим что он существует
      (assert (get-user new-user-id))
      ;; Проверим, что он залогинен
      (assert (equal ":LOGGED" (state (get-user new-user-id))))
      ;; Выход пользователя из системы
      (logout-user new-user-id)
      ;; Проверим, что он разлогинен
      (assert (equal ":UNLOGGED" (state (get-user new-user-id))))
      ;; Логин пользователя в систему
      (let ((logged-user-id))
        (aif (check-auth-data (get-auth-data (list (cons 'email email)
                                                   (cons 'password password))))
             (progn
               (login-user-success it)
               (setf logged-user-id it))
             (login-user-fail))
        ;; Проверим, что успешно залогинился
        (assert (equal ":LOGGED" (state (get-user logged-user-id))))
        ;; Сновa выход
        (logout-user logged-user-id))
      ;; Попытка логина с неверными credentials
      (let ((logged-user-id))
        (aif (check-auth-data (get-auth-data (list (cons 'email email)
                                                   (cons 'password "wrong-password"))))
             (progn
               (login-user-success it)
               (setf logged-user-id it))
             (login-user-fail))
        ;; Проверим, что не удалось успешно залогиниться
        (assert (equal nil logged-user-id))))
  #+END_SRC
