auth.html

<div id="outline-container-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> Обобщенный метод извлечения авторизационных данных</h3>
<div class="outline-text-3" id="text-3-8">


<p>
   В простейшем случае данные из объекта <code>request</code>, но возможны и другие варианты,
   поэтому этот обобщенный метод специфицируется объектом, из которого извлекаются данные.
</p>



<pre class="src src-lisp"><span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1048;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1072;&#1074;&#1090;&#1086;&#1088;&#1080;&#1079;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</span>
(<span style="color: #00cdcd; font-weight: bold;">defmethod</span> <span style="color: #0000ee; font-weight: bold;">get-auth-data</span> ((request list))
  (alist-to-plist request))
</pre>


</div>

</div>

<div id="outline-container-3-9" class="outline-3">
<h3 id="sec-3-9"><span class="section-number-3">3.9</span> Функция проверки авторизационных данных - в простейшем случае логина и пароля</h3>
<div class="outline-text-3" id="text-3-9">


<p>
   Функция принимает в качестве параметра plist, который должен содержать <code>email</code> и
   <code>password</code> введенный пользователем.
</p>
<p>
   Функция проверяет, есть ли пользователь с этим email-ом и паролем и если есть -
   возвращает его id. Если нет - возвращает nil.
</p>



<pre class="src src-lisp"><span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1072; &#1072;&#1074;&#1090;&#1086;&#1088;&#1080;&#1079;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</span>
(<span style="color: #00cdcd; font-weight: bold;">defun</span> <span style="color: #0000ee; font-weight: bold;">check-auth-data</span> (auth-data)
  (<span style="color: #00cdcd; font-weight: bold;">let</span> ((result (find-user <span style="color: #0000ee; font-weight: bold;">:email</span> (getf auth-data <span style="color: #0000ee; font-weight: bold;">:email</span>) <span style="color: #0000ee; font-weight: bold;">:password</span> (getf auth-data <span style="color: #0000ee; font-weight: bold;">:password</span>))))
    (<span style="color: #00cdcd; font-weight: bold;">if</span> (null result)
        nil
        (id (car result)))))
</pre>


</div>

</div>

<div id="outline-container-3-10" class="outline-3">
<h3 id="sec-3-10"><span class="section-number-3">3.10</span> Событие успешного входа пользователя в систему</h3>
<div class="outline-text-3" id="text-3-10">





<pre class="src src-lisp"><span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1057;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086;&#1075;&#1086; &#1074;&#1093;&#1086;&#1076;&#1072;</span>
(<span style="color: #00cdcd; font-weight: bold;">defun</span> <span style="color: #0000ee; font-weight: bold;">login-user-success</span> (id)
  (takt (get-user id) <span style="color: #0000ee; font-weight: bold;">:logged</span>))
</pre>


</div>

</div>

<div id="outline-container-3-11" class="outline-3">
<h3 id="sec-3-11"><span class="section-number-3">3.11</span> Событие неуспешного входа пользователя в систему</h3>
<div class="outline-text-3" id="text-3-11">





<pre class="src src-lisp"><span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1057;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077; &#1085;&#1077;&#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086;&#1075;&#1086; &#1074;&#1093;&#1086;&#1076;&#1072;</span>
(<span style="color: #00cdcd; font-weight: bold;">defun</span> <span style="color: #0000ee; font-weight: bold;">login-user-fail</span> ()
  <span style="color: #00cd00;">"Wrong auth"</span>
  )
</pre>


</div>

</div>

<div id="outline-container-3-12" class="outline-3">
<h3 id="sec-3-12"><span class="section-number-3">3.12</span> <span class="todo TODO">TODO</span> Забыл пароль</h3>
<div class="outline-text-3" id="text-3-12">

</div>

</div>

<div id="outline-container-3-13" class="outline-3">
<h3 id="sec-3-13"><span class="section-number-3">3.13</span> <span class="todo TODO">TODO</span> Javascript для форм, необязательно</h3>
<div class="outline-text-3" id="text-3-13">

</div>

</div>

<div id="outline-container-3-14" class="outline-3">
<h3 id="sec-3-14"><span class="section-number-3">3.14</span> <span class="todo TODO">TODO</span> Функцию проверки залогинен ли пользователь</h3>
<div class="outline-text-3" id="text-3-14">


<p>
   Создадим функцию, которая проверяет залогинен ли пользователь
</p>



<pre class="src src-lisp"><span style="color: #cd0000;">;; </span><span style="color: #cd0000;">(defun is-logged (request)</span>
<span style="color: #cd0000;">;;   </span><span style="color: #cd0000;">( (session-value current-user</span>
</pre>


</div>

</div>

<div id="outline-container-3-15" class="outline-3">
<h3 id="sec-3-15"><span class="section-number-3">3.15</span> <span class="todo TODO">TODO</span> Функцию проверки прав пользователя на доступ к какому-то объекту</h3>
<div class="outline-text-3" id="text-3-15">

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Тесты</h2>
<div class="outline-text-2" id="text-4">


<p>
  Теперь у нас есть весь необходимый функционал, для работы авторизации. Мы можем его
  протестировать, для этого сформируем тест:
</p>



<pre class="src src-lisp"><span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1058;&#1077;&#1089;&#1090;&#1080;&#1088;&#1091;&#1077;&#1084; &#1072;&#1074;&#1090;&#1086;&#1088;&#1080;&#1079;&#1072;&#1094;&#1080;&#1102;</span>
(<span style="color: #00cdcd; font-weight: bold;">defun</span> <span style="color: #0000ee; font-weight: bold;">auth-test</span> ()
  &lt;&lt;auth_test_contents&gt;&gt;
  (dbg <span style="color: #00cd00;">"passed: auth-test~%"</span>))
(auth-test)
</pre>



<pre class="src src-lisp"><span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1047;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1091;&#1077;&#1084; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;</span>
(<span style="color: #00cdcd; font-weight: bold;">let*</span> ((name <span style="color: #00cd00;">"test-name"</span>)
       (password <span style="color: #00cd00;">"test-password"</span>)
       (email <span style="color: #00cd00;">"test-email"</span>)
       (new-user-id (create-user name password email)))
  <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1084; &#1095;&#1090;&#1086; &#1086;&#1085; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;</span>
  (<span style="color: #cd0000; font-weight: bold;">assert</span> (get-user new-user-id))
  <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1086;&#1085; &#1079;&#1072;&#1083;&#1086;&#1075;&#1080;&#1085;&#1077;&#1085;</span>
  (<span style="color: #cd0000; font-weight: bold;">assert</span> (equal <span style="color: #00cd00;">":LOGGED"</span> (state (get-user new-user-id))))
  <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1042;&#1099;&#1093;&#1086;&#1076; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1080;&#1079; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;</span>
  (logout-user new-user-id)
  <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1086;&#1085; &#1088;&#1072;&#1079;&#1083;&#1086;&#1075;&#1080;&#1085;&#1077;&#1085;</span>
  (<span style="color: #cd0000; font-weight: bold;">assert</span> (equal <span style="color: #00cd00;">":UNLOGGED"</span> (state (get-user new-user-id))))
  <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1051;&#1086;&#1075;&#1080;&#1085; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091;</span>
  (<span style="color: #00cdcd; font-weight: bold;">let</span> ((logged-user-id))
    (aif (check-auth-data (get-auth-data (list (cons 'email email)
                                               (cons 'password password))))
         (<span style="color: #00cdcd; font-weight: bold;">progn</span>
           (login-user-success it)
           (setf logged-user-id it))
         (login-user-fail))
    <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086; &#1079;&#1072;&#1083;&#1086;&#1075;&#1080;&#1085;&#1080;&#1083;&#1089;&#1103;</span>
    (<span style="color: #cd0000; font-weight: bold;">assert</span> (equal <span style="color: #00cd00;">":LOGGED"</span> (state (get-user logged-user-id))))
    <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1057;&#1085;&#1086;&#1074;a &#1074;&#1099;&#1093;&#1086;&#1076;</span>
    (logout-user logged-user-id))
  <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1055;&#1086;&#1087;&#1099;&#1090;&#1082;&#1072; &#1083;&#1086;&#1075;&#1080;&#1085;&#1072; &#1089; &#1085;&#1077;&#1074;&#1077;&#1088;&#1085;&#1099;&#1084;&#1080; credentials</span>
  (<span style="color: #00cdcd; font-weight: bold;">let</span> ((logged-user-id))
    (aif (check-auth-data (get-auth-data (list (cons 'email email)
                                               (cons 'password <span style="color: #00cd00;">"wrong-password"</span>))))
         (<span style="color: #00cdcd; font-weight: bold;">progn</span>
           (login-user-success it)
           (setf logged-user-id it))
         (login-user-fail))
    <span style="color: #cd0000;">;; </span><span style="color: #cd0000;">&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1085;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086; &#1079;&#1072;&#1083;&#1086;&#1075;&#1080;&#1085;&#1080;&#1090;&#1100;&#1089;&#1103;</span>
    (<span style="color: #cd0000; font-weight: bold;">assert</span> (equal nil logged-user-id))))
</pre>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-10-13T17:03+0400</p>
<p class="author">Author: rigidus</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
